back end/app/controllers/categoria_controller.rb

  def index
    @categorias = Categoria.all
---
SELECT "categoria".* FROM "categoria"

  def create
    @categoria = Categoria.new(categoria_params)

    if @categoria.save
---
INSERT INTO "categoria" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "Electrónicos"], ["created_at", "2023-12-10 01:44:55.108395"], ["updated_at", "2023-12-10 01:44:55.108395"]]

  def update
    if @categoria.update(categoria_params)
---
UPDATE "categoria" SET "nombre" = $1, "updated_at" = $2 WHERE "categoria"."id" = $3  [["nombre", "Juegos"], ["updated_at", "2023-12-10 01:53:10.822761"], ["id", 1]]

  def destroy
    @categoria.destroy
---
DELETE FROM "categoria" WHERE "categoria"."id" = $1  [["id", 1]]

  def set_categoria
    @categoria = Categoria.find(params[:id])
---
SELECT "categoria".* FROM "categoria" WHERE "categoria"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]