back end/app/controllers/movimiento_inventarios_controller.rb

  def index
    @movimientos = MovimientoInventarios.all
---
SELECT "movimiento_inventarios".* FROM "movimiento_inventarios"

  def create
    @movimiento = MovimientoInventarios.new(movimiento_params)

    if @movimiento.save
---
INSERT INTO "movimiento_inventarios" ("producto_id", "cantidad", "fecha_movimiento", "tipo_movimiento", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_movimiento
    @movimiento = MovimientoInventarios.find(params[:id])
---
SELECT "movimiento_inventarios".* FROM "movimiento_inventarios" WHERE "movimiento_inventarios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]