back end/app/controllers/productos_controller.rb

SELECT "productos".* FROM "productos"
---
    def index
      @productos = Productos.all

INSERT INTO "productos" ("nombre", "precio", "stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "NuevoProducto"], ["precio", "29.99"], ["stock", 50], ["created_at", "2023-12-09 23:21:26.002832"], ["updated_at", "2023-12-09 23:21:26.002832"]]
---
    def create
      @producto = Productos.new(producto_params)

      if @producto.save

UPDATE "productos" SET "nombre" = $1, "stock" = $2, "updated_at" = $3 WHERE "productos"."id" = $4  [["nombre", "PS5"], ["stock", 100], ["updated_at", "2023-12-09 23:23:51.805311"], ["id", 1]]
---
    def update
      if @producto.update(producto_params)

DELETE FROM "productos" WHERE "productos"."id" = $1  [["id", 7]]
---
    def destroy
      @producto.destroy

SELECT "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_producto
      @producto = Productos.find(params[:id])