back end/app/controllers/productos_categoria_controller.rb

SELECT "productos_categoria".* FROM "productos_categoria"
---
  def index
    @productos_categorias = ProductosCategoria.all

INSERT INTO "productos_categoria" ("producto_id", "categoria_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["producto_id", 2], ["categoria_id", 3], ["created_at", "2023-12-10 04:25:55.971115"], ["updated_at", "2023-12-10 04:25:55.971115"]]
---
  def create
    @productos_categoria = ProductosCategoria.new(productos_categoria_params)

    if @productos_categoria.save

UPDATE "productos_categoria" SET "categoria_id" = $1, "updated_at" = $2 WHERE "productos_categoria"."id" = $3  [["categoria_id", 4], ["updated_at", "2023-12-10 04:26:39.554058"], ["id", 1]]
---
  def update
    if @productos_categoria.update(productos_categoria_params)

DELETE FROM "productos_categoria" WHERE "productos_categoria"."id" = $1  [["id", 1]]
---
  def destroy
    @productos_categoria.destroy

SELECT "categoria".* FROM "categoria" WHERE "categoria"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "productos_categoria".* FROM "productos_categoria" WHERE "productos_categoria"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_productos_categoria
    @productos_categoria = ProductosCategoria.find(params[:id])